cases/subsonic/Zhang/We3500/b_0_PCM/setup/constant/chemistryProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}

chemistryType
{
    solver  ode;
}

chemistry   off;

// ************************************************************************* //
