cases/subsonic/Zhang/We3500/b_0_PCM/setup/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// FASE 2 — sprayFoam (transient, spray H2O in crossflow N2)
//
// Copiare come constant/thermophysicalProperties prima del run sprayFoam:
//   cp constant/thermophysicalProperties.spray constant/thermophysicalProperties
//
// Specie nel meccanismo: N2 (inerte, portante) + H2O (liquido spray).
// Nessuna reazione (chemistry off, combustionModel none).
// CHEMKIN letto solo per definire le proprieta' termofisiche delle specie.
//

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

CHEMKINFile             "<case>/chemkin/chem.inp";
CHEMKINThermoFile       "<case>/chemkin/therm.dat";
CHEMKINTransportFile    "<case>/chemkin/transportProperties";

newFormat       yes;

inertSpecie     N2;

liquids
{
    H2O;
}

solids {}

// ************************************************************************* //
